; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(have_image Planet14 spectrograph1)
	(have_image Planet15 spectrograph1)
	(have_image Planet16 spectrograph1)
	(have_image Phenomenon17 spectrograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 phenomenon17 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 4
5. (take_image satellite0 phenomenon17 instrument0 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 1 of 4
6. (turn_to satellite0 planet14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet14)
   goals met: 1 of 4
7. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 2 of 4
8. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 2 of 4
9. (take_image satellite0 planet15 instrument0 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 3 of 4
10. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 3 of 4
11. (take_image satellite0 planet16 instrument0 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 4 of 4
